CREATE DATABASE [Інформаційна система відділу кадрів інституту] -- Створення бази даних (ФБ-01 Сахній Назар 14 Варіант)
GO

USE [Інформаційна система відділу кадрів інституту] -- Використання бази даних
GO


CREATE TABLE [Співробітники] -- Дані про співробітника інституту
(
	[ПІБ] VARCHAR(50) NOT NULL, -- Прізвище Ім'я по-Батькові
	[Дата народження] DATE NOT NULL,
	[№ Паспорта] VARCHAR(9) PRIMARY KEY, -- Номер паспорта (Первинний ключ)
	[ІПН] BIGINT NOT NULL UNIQUE, -- Індивідуальний податковий номер (Унікальне значення)
	[Дата видачі паспорта] DATE NOT NULL,
	[Ким видано паспорт] INT NOT NULL, -- Вказується код органу, який видав пасорт
	[№ Трудової книжки] INT NOT NULL UNIQUE, -- Номер трудової книжки (Унікальне значення)
	[Дата видачі трудової книжки] DATE NOT NULL, 
	[№ Пенсійного посвідчення] BIGINT NULL, -- Номер пенсійного посвідчення (Унікальне значення)
	[Кафедра] VARCHAR(100) NOT NULL, -- Назва кафедри, на якій працює співробітник
	[Ступінь] VARCHAR(30) NOT NULL, -- Назва науково-освітнього ступеня (бакалавр, кандидат технічних наук, доктор математичних наук...)
)
GO

CREATE TABLE [Перелік нагород] -- Деякі співробітники можуть мати деякі нагороди
(
	[ID__Нагороди] INT PRIMARY KEY, -- Ідентифікатор нагороди
	[№ Паспорта] VARCHAR(9) NOT NULL, -- Номер паспорта
	[Нагорода] VARCHAR(100) NOT NULL, -- Назва урядової нагороди
	FOREIGN KEY ([№ Паспорта])              
		REFERENCES [Співробітники]([№ Паспорта])  /*  (Зовнішній ключ на атрибут [№ Паспорта] із таблиці [Співробітники])  */
		ON UPDATE CASCADE
		ON DELETE CASCADE,
)
GO

CREATE TABLE [Наказ] -- Повинен бути відпівідний наказ про певні дії
(
	[№ Паспорта] VARCHAR(9) NOT NULL, -- Номер паспорта
    [№ Наказу] INT PRIMARY KEY, -- Номер наказу (Первинний ключ)
	[Назва наказу] VARCHAR(40) NOT NULL, -- На цей атрибут поставимо обмеження CHECK
	[Дата видачі наказу] DATE NOT NULL,
	FOREIGN KEY ([№ Паспорта])              
		REFERENCES [Співробітники]([№ Паспорта])  /*  (Зовнішній ключ на атрибут [№ Паспорта] із таблиці [Співробітники])  */
		ON UPDATE CASCADE
		ON DELETE CASCADE,
	CHECK([Назва наказу] IN ('Наказ про зарахування', 'Наказ про звільнення', 'Наказ про перехід в інший підрозділ', 'Наказ про зміну посади')),
)
GO

CREATE TABLE [Відпускні] -- Всі співробітники повинні мати відпускні
(
	[№ Паспорта] VARCHAR(9) NOT NULL, -- Номер паспорта
	[№ Відпустки] INT PRIMARY KEY, -- Номер накузу про відпустку (Первинний ключ)
	[Початок відпустки] DATE NOT NULL, -- Дата початку відпустки
	[Кінець відпустки] DATE NOT NULL, -- Дата закінчення відпустки
	FOREIGN KEY ([№ Паспорта])              
		REFERENCES [Співробітники]([№ Паспорта])  /*  (Зовнішній ключ на атрибут [№ Паспорта] із таблиці [Співробітники])  */
		ON UPDATE CASCADE
		ON DELETE CASCADE
)
GO

CREATE TABLE [Список посад] -- Відомість про те, хто ким працює
(
	[ID__Посади] INT PRIMARY KEY, -- Ідентифікатор посади (Первинний ключ)
	[№ Паспорта] VARCHAR(9) NOT NULL, -- Номер паспорта
	[Посада] VARCHAR(30) NOT NULL, -- Назва посади (Класифікація професії)
	FOREIGN KEY ([№ Паспорта])              
		REFERENCES [Співробітники]([№ Паспорта])  /*  (Зовнішній ключ на атрибут [№ Паспорта] із таблиці [Співробітники])  */
		ON UPDATE CASCADE
		ON DELETE CASCADE
)
GO

CREATE TABLE [Викладачі] -- Деякі співробітники можуть працювати, як викладач
(
	[№ Паспорта] VARCHAR(9) PRIMARY KEY, -- Ідентифікатор викладача (Первинний ключ)	
	[Навантаження (в годинах)] INT NOT NULL, -- Навантаження в поточному році (сумарна кількість годин)
	[Стаж (в роках)] INT NOT NULL, -- Педагогічний стаж
	[Звання] VARCHAR(30) NOT NULL, -- Назва категорії викладача (асистент, доцент, професор...)
	FOREIGN KEY ([№ Паспорта])              
		REFERENCES [Співробітники]([№ Паспорта])  /*  (Зовнішній ключ на атрибут [№ Паспорта] із таблиці [Співробітники])  */
		ON UPDATE CASCADE
		ON DELETE CASCADE	
)
GO

CREATE TABLE [Перелік дисциплін] -- У кожного викладача є свій перелік дисциплін, які він викладав або може викладати
(
	[№ Паспорта] VARCHAR(9) NOT NULL, -- Номер паспорта
	[№ Контракту] INT PRIMARY KEY, -- Номер укладеного контракту, який засвідчує, що викладач буде проводити заняття з цієї дисципліни  (Первинний ключ)
	[Дисципліна] VARCHAR(50) NOT NULL, -- Назва дисципліни, з якої викладач проводить або ж міг би проводити навчальні заняття
	[Дата укладання контракту] DATE NOT NULL,
	[Дата закінчення контракту] DATE NOT NULL,
	FOREIGN KEY ([№ Паспорта])              
		REFERENCES [Викладачі]([№ Паспорта])  /*  (Зовнішній ключ на атрибут [№ Паспорта] із таблиці [Викладачі])  */
		ON UPDATE CASCADE
		ON DELETE CASCADE	
)
GO

-- Створити BACKUP
USE [Інформаційна система відділу кадрів інституту] -- Використання бази даних
GO

BACKUP DATABASE [Інформаційна система відділу кадрів інституту]
	TO DISK = 'D:\KPI\БД та ІС\Курсова робота_14\Viddil kadriv.bak'
	WITH INIT
