USE [Інформаційна система відділу кадрів інституту]
GO


INSERT INTO [Співробітники] ([ПІБ], [Дата народження], [№ Паспорта], [ІПН], [Дата видачі паспорта], [Ким видано паспорт],
							 [№ Трудової книжки], [Дата видачі трудової книжки], 
							 [№ Пенсійного посвідчення], [Кафедра], [Ступінь])
VALUES ('Антоненко Борис Олексійович', '1989-10-20', '001934119', 1410341070, '2007-11-02', 7485,
		868619, '2009-10-23', 
		1134612641, 'Інформаційна безпека', 'Магістр'),
	   ('Захарчук Мирослав Олександрович', '1955-01-07', '002143478', 7153344529, '1976-01-26', 1475,
		286333, '1979-10-05',
		7554465613, 'Прикладна фізика', 'Молодший спеціаліст'),
	   ('Захарчук Кіра Мирославівна', '1964-03-10', '005175630', 5921127418, '1982-04-05', 8086, 
		882826, '1982-05-07', 
		NULL, 'Математичні методи захисту інформації', 'Бакалавр'),
	   ('Романченко Світлана Борисівна', '1986-02-26', '005315584', 4386534907, '2004-03-12', 3233, 
		447400, '2005-10-03', 
		NULL, 'Математичне моделювання і аналіз даних', 'Магістр'),
	   ('Васильчук Андрій Олексійович', '1972-07-05', '006444136', 7152587596, '1990-07-30', 7410, 
		881580, '1995-03-19', 
		NULL, 'Інформаційна безпека', 'Молодший спеціаліст'), 
	   ('Василенко Мирослав Йосипович', '1950-06-10', '003157280', 4757347425, '1977-06-27', 1429, 
		338837, '1976-03-11',
		4285378378, 'Прикладна фізика', 'Доктор технічних наук'), 
	   ('Шевчук Дарина Валеріївна', '1969-10-10', '001108432', 9345600214, '1987-10-24', 3574, 
		631338, '1988-04-06',
		NULL, 'Математичне моделювання і аналіз даних', 'Доктор технічних наук'),
	   ('Павлюк Анастасія Володимирівна', '1993-09-20', '003250892', 1313815763, '2011-10-05', 1715, 
		486198, '2011-10-01',
		NULL, 'Математичні методи захисту інформації', 'Магістр'), 
	   ('Микитюк Максим Сергійович', '1948-12-04', '004614499', 3381133412, '1966-12-27', 9841, 
		355720, '1965-11-22',
		3400158937, 'Математичне моделювання і аналіз даних', 'Кандидат фіз.-мат. наук'), 
	   ('Пономаренко Софія Василівна', '1981-08-03', '009786039', 9265726811, '1989-08-20', 3247, 
		349987, '1989-12-10', 
		NULL, 'Інформаційна безпека', 'Магістр'), 
	   ('Шевченко Алла Володимирівна', '1953-03-11', '001716288', 4061379980, '1971-04-09', 0239, 
		941813, '1973-10-10',
		4529436683, 'Математичні методи захисту інформації', 'Доктор фіз.-мат. наук'), 
	   ('Петренко Мирослав Романович', '1986-08-17', '009578017', 2771234969, '2004-09-12', 2424, 
		149119, '2006-04-04', 
		NULL, 'Математичне моделювання і аналіз даних', 'Магістр'), 
	   ('Харенко Лариса Михайлівна', '1980-11-06', '003585813', 8178789698, '1998-11-30', 8761, 
		329605, '2000-03-15', 
		NULL, 'Прикладна фізика', 'Бакалавр'), 
	   ('Антоненко Єлизавета Андріївна', '1980-05-15', '001442886', 7663593497, '1998-05-20', 5554, 
		284317, '1999-04-18',
		NULL, 'Математичне моделювання і аналіз даних', 'Бакалавр'), 
	   ('Пономаренко Вадим Йосипович', '1952-03-03', '006604855', 4669695106, '1970-03-24', 1234, 
		449867, '1972-12-08',
		4302383849, 'Математичні методи захисту інформації', 'Доктор фіз.-мат. наук'),
	   ('Мірошниченко Олег Борисович', '1960-11-19', '005410021', 5048363035, '1978-12-02', 8888, 
		831015, '1979-10-05',
		NULL, 'Прикладна фізика', 'Молодший спеціаліст'), 
	   ('Лисенко Микита Петрович', '1959-09-10', '003188049', 2030458774, '1977-09-25', 9300, 
		309161, '1979-04-07', 
		NULL, 'Інформаційна безпека', 'Доктор технічних наук'), 
	   ('Шевченко Тарас Михайлович', '1969-08-26', '003423475', 1184308923, '1987-09-10', 5412, 
		960374, '1986-04-01',
		NULL, 'Інформаційна безпека', 'Кандидат фіз.-мат. наук'),
	   ('Павлюк Олена Олександрівна', '1984-10-17', '001828191', 3864746832, '2002-11-02', 1715, 
		672919, '2004-12-10',
		NULL, 'Математичні методи захисту інформації', 'Молодший спеціаліст'), 
	   ('Шевчук Станіслав Андрійович', '1969-11-10', '005780206', 2991109601, '1987-12-12', 7788, 
		275748, '1990-06-07', 
		NULL, 'Прикладна фізика', 'Кандидат технічних наук')
GO

INSERT INTO [Перелік нагород] (ID__Нагороди, [№ Паспорта], [Нагорода])
VALUES (1, '001934119', 'Ветеран Війни'), 
	   (2, '003157280', 'Медаль ім. І.В. Пулюя'),
	   (3, '004614499', 'Ветеран Війни'),
	   (4, '001716288', 'Медаль ім. М.В. Остроградського'),
	   (5, '003188049', 'Орден "За особливі заслуги"')
GO

INSERT INTO [Наказ] ([№ Паспорта], [№ Наказу], [Назва наказу], [Дата видачі наказу])
VALUES ('001934119', 24, 'Наказ про зарахування', '2010-01-20'),
	   ('002143478', 10, 'Наказ про зарахування', '1996-08-25'),
	   ('005175630', 12, 'Наказ про зарахування', '1998-08-10'),  ('005175630', 16, 'Наказ про перехід в інший підрозділ', '2000-06-29'),	('005175630', 21, 'Наказ про зміну посади', '2006-02-08'),
	   ('005315584', 23, 'Наказ про зарахування', '2010-01-14'),  ('005315584', 32, 'Наказ про перехід в інший підрозділ', '2021-01-09'),
	   ('006444136', 28, 'Наказ про зарахування', '2014-11-23'),
	   ('003157280', 4, 'Наказ про зарахування', '1995-08-10'),	  ('003157280', 8, 'Наказ про зміну посади', '1996-01-12'),				    ('003157280', 39, 'Наказ про звільнення', '2021-12-22'),
	   ('001108432', 6, 'Наказ про зарахування', '1995-08-12'),	  ('001108432', 33, 'Наказ про перехід в інший підрозділ', '2021-01-09'),	('001108432', 37, 'Наказ про зміну посади', '2021-01-10'),
	   ('003250892', 25, 'Наказ про зарахування', '2012-07-26'),  ('003250892', 38, 'Наказ про звільнення', '2021-12-21'),
	   ('004614499', 3, 'Наказ про зарахування', '1995-08-08'),	  ('004614499', 34, 'Наказ про перехід в інший підрозділ', '2021-01-09'),	('004614499', 40, 'Наказ про звільнення', '2021-12-22'),
	   ('009786039', 19, 'Наказ про зарахування', '2002-03-24'),
	   ('001716288', 5, 'Наказ про зарахування', '1995-08-10'),	  ('001716288', 17, 'Наказ про перехід в інший підрозділ', '2000-06-29'), 
	   ('009578017', 22, 'Наказ про зарахування', '2006-08-02'),  ('009578017', 35, 'Наказ про перехід в інший підрозділ', '2021-01-09'),	('009578017', 29, 'Наказ про зміну посади', '2015-05-05'),
	   ('003585813', 30, 'Наказ про зарахування', '2018-03-08'),
	   ('001442886', 11, 'Наказ про зарахування', '1998-07-28'),  ('001442886', 36, 'Наказ про перехід в інший підрозділ', '2021-01-09'),
	   ('006604855', 2, 'Наказ про зарахування', '1995-08-08'),	  ('006604855', 18, 'Наказ про перехід в інший підрозділ', '2000-06-29'),	('006604855', 20, 'Наказ про зміну посади', '2005-08-29'),
	   ('005410021', 9, 'Наказ про зарахування', '1996-04-28'),
	   ('003188049', 1, 'Наказ про зарахування', '1995-08-08'),	  ('003188049', 13, 'Наказ про перехід в інший підрозділ', '1999-07-02'),	('003188049', 14, 'Наказ про зміну посади', '1999-07-02'), ('003188049', 26, 'Наказ про зміну посади', '2013-07-14'),
	   ('003423475', 15, 'Наказ про зарахування', '1999-08-12'),
	   ('001828191', 31, 'Наказ про зарахування', '2019-09-10'),  ('001828191', 41, 'Наказ про звільнення', '2021-12-24'),
	   ('005780206', 7, 'Наказ про зарахування', '1995-08-20'),	  ('005780206', 27, 'Наказ про зміну посади', '2013-07-14')
GO

INSERT INTO [Відпускні] ([№ Паспорта], [№ Відпустки], [Початок відпустки], [Кінець відпустки])
VALUES ('001934119', 8, '2018-01-20', '2018-02-20'),	('001934119', 32, '2022-07-30', '2022-08-10 '),
	   ('002143478', 6, '2017-10-25', '2017-11-15'),	('002143478', 18, '2019-12-18', '2020-01-08'), 
	   ('005175630', 9, '2018-03-01', '2018-03-30'), 
	   ('005315584', 15, '2019-05-25', '2019-06-13'),	('005315584', 25, '2021-02-06', '2021-02-27'), 
	   ('006444136', 4, '2016-09-24', '2016-10-10 '),	('006444136', 12, '2019-03-30', '2019-04-14'),
	   ('003157280', 1, '2014-05-22', '2014-06-18'),	('003157280', 30, '2022-05-27', '2022-06-07'), 
	   ('001108432', 21, '2020-02-12', '2020-03-01'),	('001108432', 33, '2022-11-01', '2022-11-30'),
	   ('003250892', 29, '2022-01-02', '2022-01-20'), 
	   ('004614499', 3, '2016-07-11', '2016-08-10'),	('004614499', 22, '2020-03-15', '2020-04-15'), 
	   ('009786039', 11, '2019-03-09', '2019-04-09'),	('009786039', 19, '2019-12-29', '2020-01-07'),
	   ('001716288', 7, '2017-12-09', '2017-12-29'), 
	   ('009578017', 14, '2019-05-09', '2019-05-19'),	('009578017', 27, '2021-12-08', '2021-12-18'),
	   ('003585813', 17, '2019-11-11', '2019-11-24'),	('003585813', 34, '2022-12-05', '2022-12-26'), 
	   ('001442886', 26, '2021-07-21', '2021-08-21'),
	   ('006604855', 2, '2015-12-03', '2015-12-23'),	('006604855', 20, '2020-01-23', '2020-01-25 '), 
	   ('005410021', 13, '2019-04-13', '2019-05-13'),	('005410021', 24, '2021-02-02', '2021-03-02'), 
	   ('003188049', 31, '2022-05-28', '2022-06-28 '), 
	   ('003423475', 23, '2021-01-23', '2021-02-23'),   
	   ('001828191', 10, '2018-05-18', '2018-05-22'),   ('001828191', 16, '2019-10-10', '2019-10-22'),
	   ('005780206', 5, '2017-10-14', '2017-10-30'),	('005780206', 28, '2021-12-24', '2021-12-31')
GO

INSERT INTO [Список посад] (ID__Посади, [№ Паспорта], [Посада])
VALUES (1, '001934119', 'Викладач'),
	   (2, '002143478', 'Електрик'),
	   (3, '005175630', 'Адміністратор'),				  (4, '005175630', 'Викладач'),
	   (5, '005315584', 'Викладач'),						
	   (6, '006444136', 'Сторож'),
	   (7, '003157280', 'Завідувач кафедри'),			  (8, '003157280', 'Викладач'),
	   (9, '001108432', 'Завідувач кафедри'),			  (10, '001108432', 'Викладач'),
	   (11, '003250892', 'Викладач'),
	   (12, '004614499', 'Викладач'),
	   (13, '009786039', 'Фінансист'),
	   (14, '001716288', 'Викладач'),
	   (15, '009578017', 'Адміністратор'),				  (16, '009578017', 'Викладач'),
	   (17, '003585813', 'Прибиральник'),
	   (18, '001442886', 'Бухгалтер'),
	   (19, '006604855', 'Завідувач кафедри'),			  (20, '006604855', 'Викладач'),
	   (21, '005410021', 'Сторож'),
	   (22, '003188049', 'Директор інституту'),			  (23, '003188049', 'Викладач'),
	   (24, '003423475', 'Завідувач кафедри'),			  (25, '003423475', 'Викладач'),
	   (26, '001828191', 'Прибиральник'),
	   (27, '005780206', 'Заступник директора інституту'),  (28, '005780206', 'Викладач')
GO

INSERT INTO [Викладачі] ([№ Паспорта], [Навантаження (в годинах)], [Стаж (в роках)], [Звання])
VALUES ('001934119', 240, 11, 'Асистент'),
	   ('005175630', 198, 33, 'Старший викладач'),
	   ('005315584', 294, 11, 'Асистент'),
	   ('003157280', 220, 48, 'Професор'),
	   ('001108432', 436, 28, 'Професор'),
	   ('003250892', 264, 9, 'Асистент'),
	   ('004614499', 208, 52, 'Доцент'),
	   ('001716288', 512, 45, 'Доцент'),
	   ('009578017', 314, 15, 'Старший викладач'),
	   ('006604855', 556, 46, 'Професор'),
	   ('003188049', 336, 38, 'Професор'),
	   ('003423475', 378, 29, 'Доцент'),
	   ('005780206', 196, 29, 'Доцент')
GO

INSERT INTO [Перелік дисциплін] ([№ Паспорта], [№ Контракту], [Дисципліна], [Дата укладання контракту], [Дата закінчення контракту])
VALUES ('001934119', 12, 'Архітектури комп''ютерних систем', '2016-08-22', '2023-12-22'), ('001934119', 26, 'Основи комп''ютерних мереж', '2021-01-28', '2023-06-28'),
	   ('005175630', 28, 'Алгебра та геометрія', '2021-08-30', '2022-12-30'),
	   ('005315584', 19, 'Дискретна математика', '2018-08-25', '2024-12-25'), ('005315584', 21, 'Основи теорії скінченних полів', '2019-01-26', '2025-06-26'),
	   ('003157280', 22, 'Фізика', '2019-01-30', '2021-12-30'), ('003157280', 17, 'Актуальні проблеми прикладної фізики', '2017-12-30', '2021-12-30'), 
	   ('001108432', 4, 'Інтелектуальні системи', '2012-02-12', '2016-08-12'),
	     ('001108432', 11, 'Програмування', '2016-08-13', '2025-06-13'),
	   ('003250892', 5, 'Реляційна алгебра', '2012-07-29', '2017-08-29'),
	     ('003250892', 13, 'Бази даних', '2016-10-30', '2021-12-30'),
	   ('004614499', 10, 'Основи аналізу алгоритмів', '2016-07-30', '2021-12-30'), ('004614499', 24, 'Криптографія', '2019-08-30', '2021-12-30'),
	   ('001716288', 6, 'Алгебра та геометрія', '2014-06-23', '2022-06-23'), ('001716288', 16, 'Дискретна математика', '2017-08-30', '2024-12-30'),
	   ('009578017', 14, 'Дискретна математика', '2017-01-20', '2024-01-20'), ('009578017', 18, 'Криптографія', '2018-01-16', '2023-01-16'),
	   ('006604855', 3, 'Розділи сучасної криптології', '2012-01-30', '2015-01-30'), 
	     ('006604855', 8, 'Комбінаторний аналіз', '2015-01-31', '2022-06-30'), ('006604855', 20, 'Методи криптоаналізу', '2018-08-28', '2026-12-28'),
	   ('003188049', 1, 'Технічний аудит', '2009-01-10', '2013-01-10'), ('003188049', 15, 'Кібернетична безпека', '2017-06-24', '2019-06-24'),
	   ('003423475', 9, 'Операційні системи', '2016-01-24', '2019-06-24'),  
	     ('003423475', 23, 'Безпека операційних систем і комп''ютерних мереж', '2019-06-25', '2024-06-28'), ('003423475', 27, 'Основи комп''ютерних мереж', '2021-01-28', '2023-06-28'),
       ('005780206', 2, 'Оптика', '2009-08-28', '2013-06-28'), 
		 ('005780206', 7, 'Фізика', '2014-06-23', '2020-06-23'),
		   ('005780206', 25, 'Фізика', '2020-06-26', '2024-06-26')
GO


SELECT * FROM [Співробітники];

SELECT * FROM [Перелік нагород];

SELECT * FROM [Наказ];

SELECT * FROM [Відпускні];

SELECT * FROM [Список посад];

SELECT * FROM [Викладачі]

SELECT * FROM [Перелік дисциплін];

