USE [Інформаційна система відділу кадрів інституту]
GO

-- Можливість видачі довідки про співробітників інституту, які перебувають у відпустці у поточному місяці
CREATE PROCEDURE [Співробітники, які в поточному місяці у відпустці]
AS
SELECT 
	[ПІБ],
	[Початок відпустки],
	[Кінець відпустки]
FROM
	[Співробітники] INNER JOIN [Відпускні]
	ON [Співробітники].[№ Паспорта] = [Відпускні].[№ Паспорта]
WHERE MONTH([Початок відпустки]) = (MONTH( CAST( GETDATE() AS DATE )))
	  AND
	  YEAR([Початок відпустки]) = (YEAR( CAST( GETDATE() AS DATE )))
GO


-- Звіт по кафедрам про викладачів, які читають кожну з дисциплін. 
CREATE PROCEDURE [Викладачі, які читають кожну з дисциплін] @Kafedra VARCHAR(100)
AS
SELECT 
	[ПІБ] AS 'ПІБ викладача',
	[Кафедра],
	COUNT([Дисципліна]) AS 'Кількість дисциплін на кафедрі' -- Тобто це всі дисципліни кафедри і цей викладач зможе проводити заняття з них
FROM 
	[Співробітники] INNER JOIN [Перелік дисциплін]
	ON [Співробітники].[№ Паспорта] = [Перелік дисциплін].[№ Паспорта]
WHERE [Кафедра] = @Kafedra
	  AND 
	  [Дата закінчення контракту] >= CAST( GETDATE() AS DATE)
GROUP BY [Кафедра], [ПІБ]
HAVING COUNT([Дисципліна]) >= ALL(SELECT COUNT(DISTINCT [Дисципліна])
						          FROM 	[Співробітники] INNER JOIN [Перелік дисциплін]
										ON [Співробітники].[№ Паспорта] = [Перелік дисциплін].[№ Паспорта]
						          WHERE [Кафедра] = @Kafedra
										AND
										[Дата закінчення контракту] >= CAST( GETDATE() AS DATE )
							      GROUP BY [Кафедра])
GO


-- Для кожної кафедри також можна вказати різницю між її середнім навантаженням і середнім навантаженням по інституту.
CREATE PROCEDURE [Різниця між середнім навантаженням кафедри і середнім навантаженням по інституту]
AS
SELECT
	[Кафедра],
	AVG(AVG([Навантаження (в годинах)])) OVER () AS 'Середнє навантаження по інституту',
	AVG([Навантаження (в годинах)]) AS 'Середнє навантаження по кафедрі',
	AVG(AVG([Навантаження (в годинах)])) OVER () - AVG([Навантаження (в годинах)]) AS 'Різниця навантажень'		
FROM 
	[Співробітники] INNER JOIN [Викладачі]
	ON [Співробітники].[№ Паспорта] = [Викладачі].[№ Паспорта]
GROUP BY [Кафедра]
GO


EXEC [Співробітники, які в поточному місяці у відпустці]

EXEC [Викладачі, які читають кожну з дисциплін] 'Прикладна фізика'

EXEC [Різниця між середнім навантаженням кафедри і середнім навантаженням по інституту]