USE [Інформаційна система відділу кадрів інституту]
GO


CREATE PROCEDURE [Викладачі певної кафедри] @Kafedra VARCHAR(100)
AS
SELECT 
	[ПІБ],
	[Посада],
	[Звання],
	[Кафедра],	   
	[Стаж (в роках)]	   
FROM
	[Співробітники] INNER JOIN [Список посад]
	ON [Співробітники].[№ Паспорта] = [Список посад].[№ Паспорта]
	INNER JOIN [Викладачі] 
	ON [Список посад].[№ Паспорта] = [Викладачі].[№ Паспорта]
WHERE [Кафедра] = @Kafedra 
      AND 
	  [Посада] = 'Викладач'
GO

CREATE PROCEDURE [Середнє навантаження асистентів] @Kafedra VARCHAR(100)
AS
SELECT 
	[Кафедра],	   
	AVG([Навантаження (в годинах)]) AS 'Середнє навантаження асистентів'
FROM
	[Співробітники] INNER JOIN [Викладачі]
	ON [Співробітники].[№ Паспорта] = [Викладачі].[№ Паспорта]
WHERE [Звання] = 'Асистент' 
      AND 
	  [Кафедра] = @Kafedra
GROUP BY [Кафедра]
GO

CREATE PROCEDURE [Дисципліни кожного доцента певної кафедри] @Kafedra VARCHAR(100)
AS
SELECT
	[ПІБ],
	[Кафедра],
	[Звання],
	[Дисципліна]
FROM 
	[Співробітники] INNER JOIN [Викладачі]
	ON [Співробітники].[№ Паспорта] = [Викладачі].[№ Паспорта]
	INNER JOIN [Перелік дисциплін]
	ON [Викладачі].[№ Паспорта] = [Перелік дисциплін].[№ Паспорта]
WHERE [Звання] = 'Доцент' 
      AND 
	  [Кафедра] = @Kafedra 
	  AND 
	  [Дата закінчення контракту] > CAST( GETDATE() AS DATE) /* Означає, що цей доцент зможе викладати свою дисципліну, 
	                                                             адже у нього ще не закінчився контракт по цьому предмету */
GO

CREATE PROCEDURE [Кількість викладачів кожної з категорій]
AS
SELECT
	[Звання],
	COUNT([№ Паспорта]) AS 'Кількість викладачів'
FROM 
	[Викладачі]
GROUP BY [Звання]
GO

CREATE PROCEDURE [Співробітники, які у відпустці у певному місяці] @Month INT, @Year INT
AS            -- Тобто вони мають принаймні один день відпустки у конкретному місяці
SELECT
	[ПІБ],
	[Початок відпустки],
	[Кінець відпустки]
FROM
	[Співробітники] INNER JOIN [Відпускні]
	ON [Співробітники].[№ Паспорта] = [Відпускні].[№ Паспорта]
WHERE MONTH([Початок відпустки]) = @Month 
      AND 
	  YEAR([Початок відпустки]) = @Year
GO

CREATE PROCEDURE [Викладачі, у яких закінчився термін контракту]
AS
SELECT 
	[ПІБ],
	[Дисципліна] AS 'Дисципліна (яку більше не викладає)', -- Назва дисципліни, по якій закінчився термін контракту
	[Дата укладання контракту],
	[Дата закінчення контракту]
FROM
	[Співробітники] INNER JOIN [Перелік дисциплін]
	ON [Співробітники].[№ Паспорта] = [Перелік дисциплін].[№ Паспорта]
WHERE [Дисципліна] != ALL(SELECT [Дисципліна]
						  FROM [Перелік дисциплін]
						  WHERE [Дата закінчення контракту] >= CAST( GETDATE() AS DATE)) -- У форматі YYYY.MM.DD
GO

CREATE PROCEDURE [Співробітники, які нагороджені медаллю 'Ветеран Війни']
AS
SELECT 
	[ПІБ],
	[Нагорода]
FROM 
	[Співробітники] INNER JOIN [Перелік нагород]
	ON [Співробітники].[№ Паспорта] = [Перелік нагород].[№ Паспорта]
WHERE [Нагорода] = 'Ветеран Війни'
GO

CREATE PROCEDURE [Хто може викладати] @Dystsyplina VARCHAR(50)
AS
SELECT 
	[ПІБ],
	[Дисципліна]
FROM 
	[Співробітники] INNER JOIN [Перелік дисциплін]
	ON [Співробітники].[№ Паспорта] = [Перелік дисциплін].[№ Паспорта]
WHERE [Дисципліна] = @Dystsyplina 
	  AND 
	  [Дата закінчення контракту] > CAST( GETDATE() AS DATE) /* Означає, що викладач зможе викладати свою дисципліну, 
	                                                             адже у нього ще не закінчився контракт по цьому предмету */
GO

CREATE PROCEDURE [Хто із співробітників довше інших працює в інституті] 
AS
SELECT 
	[ПІБ],
	[Дата видачі наказу] AS 'Дата видачі наказу про зарахування',
	(YEAR( CAST( GETDATE() AS DATE ))) - (YEAR([Дата видачі наказу])) AS 'Досвід у роках',
	(MONTH( CAST( GETDATE() AS DATE ))) - (MONTH([Дата видачі наказу])) AS 'Досвід у місяцях',
	(DAY( CAST( GETDATE() AS DATE ))) - (DAY([Дата видачі наказу])) AS 'Досвід у днях'
FROM 
	[Співробітники] INNER JOIN [Наказ]
	ON [Співробітники].[№ Паспорта] = [Наказ].[№ Паспорта]
WHERE [Назва наказу] = 'Наказ про зарахування' 
	  AND 
      [Дата видачі наказу] <= ALL(SELECT [Дата видачі наказу]
								  FROM
								      [Співробітники] INNER JOIN [Наказ]
									  ON [Співробітники].[№ Паспорта] = [Наказ].[№ Паспорта]
								  WHERE [Назва наказу] = 'Наказ про зарахування')
GO
