INSERT INTO Group_name(group_name)
	VALUES('ФФ-01'), ('ФІ-01'), ('ФІ-02'), ('ФБ-01'), ('ФБ-02'), ('ФБ-03'), ('ФБ-04'), ('ФБ-05'), ('ФБ-06'), ('ФЕ-01');

INSERT INTO Student(ID__group_name, lastname, firstname, patronymic_name)
	VALUES(1, 'Руденко', 'Роман', 'Андрійович'), (1, 'Усимчук', 'Петро', 'Анатолійович'), (1, 'Литвин', 'Велерія', 'Олександрівна'), 
		  (2, 'Єрмолатій', 'Валентин', 'Ігорович'), (2, 'Кривцов', 'Олег', 'Сергійович'),
		  (3, 'Яремчук', 'Марія', 'Андріївна'), 
		  (4, 'Сахній', 'Назар', 'Романович'), (4, 'Шевченко', 'Дмитрій', 'Миколайович'),
		  (5, 'Шевченко', 'Дмитро', 'Віталійович'),
		  (6, 'Антонеко', 'Анна', 'Вікторівна'), (6, 'Пападополус', 'Парфіон', 'Аристократієвич'),
		  (7, 'Парфілова', 'Олеся', 'Романівна'),
	      (8, 'Леонова', 'Анастасія', 'Вадимівна'),
		  (8, 'Раменра', 'Мурат', 'Саміль'),
		  (9, 'Кузьменко', 'Ігор', 'Станіславович'),
		  (10, 'Нікітін', 'Костянтин', 'Георгійович');

INSERT INTO Exam_result(ID__student, mark)
	VALUES(1, 'Задовільно'), (2, 'Відмінно'), (3, 'Добре'), (4, 'Не здав'), (5, 'Добре'), (6, 'Добре'), (7, 'Відмінно'), (8, 'Відмінно'), 
	(9, 'Задовільно'), (10, 'Добре'), (11, 'Добре'), (12, 'Задовільно'), (13, 'Не здав'), (14, 'Відмінно'), (15, 'Добре'), (16, 'Задовільно');